const support = {
  msg: "success",
  code: 200,
  data: [
    {
      name: "常见问题",
      id: "00001",
      children: [{ name: "常见问题", path: "common" }]
    },
    {
      name: "账号指南",
      id: "00002",
      children: [
        { name: "注册", path: "register" },
        { name: "登录", path: "login" },
        { name: "账号管理", path: "account" }
      ]
    },

    {
      name: "预约指南",
      id: "00004",
      children: [
        { name: "预约挂号须知总则", path: "general-rules" },
        { name: "预约挂号流程", path: "process" },
        { name: "如何查询/预约取消", path: "cancle" }
      ]
    },
    {
      name: "账号申诉",
      id: "00005",
      children: [{ name: "账号申诉", path: "appeal" }]
    }
  ]
};

const common = {
  code: 200,
  msg: "success",
  data: '### 怎样通过北京114预约挂号平台预约挂号？\n\n您可以在微信、支付宝、百度APP搜索“京通”小程序访问北京114预约挂号平台，可以在微信上搜索关注“北京114预约挂号”公众号，也可以拨打010-114进行电话挂号。\n\n“京通”小程序使用流程：在微信、支付宝、百度APP搜索“京通”小程序，选择“北京通”菜单—点击“预约挂号114”模块即可。\n\n微信公众号使用流程：微信搜索“北京114预约挂号”公众号或微信扫描下方二维码即可。\n\n电话使用流程：本市患者拨打114（外省市患者拨打010-114）根据语音提示选择“2”进入预约挂号。\n\n\n### 首次使用平台预约，是否可以不注册就预约挂号?\n\n首次使用平台，需要进行注册才能够使用预约挂号服务，可在微信、支付宝、百度APP搜索“京通”小程序（，选择“北京通”菜单—点击“预约挂号114”模块）、微信搜索【北京114预约挂号】微信公众号、登录北京市预约挂号统一平台网站或拨打114电话注册用户信息。\n\n\n### 北京114预约挂号平台需要线上付费吗？\n\n您使用北京114预约挂号平台时无需缴费。到医院取号时进行缴费。\n\n\n### 医保患者在北京114预约挂号平台挂号能线上缴费或报销吗？\n\n您使用北京114预约挂号平台挂号时无需缴费。到医院取号时进行缴费。\n\n\n### 北京114预约挂号平台能查询化验检查结果吗？\n\n为方便患者就医，北京114预约挂号平台新增部分医院的检验检查报告查询功能，目前支持41家医院的检验检查报告结果线上查询。\n\n### 怎么查检验检查报告？\n\n您可通过“京通”小程序或微信公众号使用北京114预约挂号平台的“报告查询”模块，系统校验身份信息后，即可查看报告详情。\n\n\n### 除本人以外是否支持查询家人检验检查报告？\n\n您可通过“京通”小程序或微信公众号使用北京114预约挂号平台的“报告查询”模块，选择他人代查，系统校验身份信息通过后，即可查看报告详情。\n\n\n### 能查哪些检验检查报告？\n\n检验报告及X光、CT、核磁的检查报告，检查报告不包含影像资料。其他报告暂不支持。\n\n\n### 能够查到哪些医院检验检查报告？\n\n北京114预约挂号平台目前支持103家医院（名单附后）的检验、检查报告结果线上查询，后续将逐步扩大医院范围。\n\n三级医院：\n1. 北京大学第三医院\n2. 中国医学科学院北京协和医院\n3. 首都医科大学附属北京朝阳医院\n4. 首都医科大学附属北京友谊医院\n5. 中国中医科学院广安门医院\n6. 北京大学人民医院\n7. 北京大学第一医院\n8. 北京中医药大学东直门医院\n9. 首都医科大学附属北京积水潭医院\n10. 首都医科大学附属北京同仁医院\n11. 中日友好医院\n12. 首都医科大学附属北京潞河医院\n13. 首都医科大学附属北京儿童医院\n14. 首都医科大学附属北京天坛医院\n15. 中国中医科学院西苑医院\n16. 首都医科大学附属北京安贞医院\n17. 首都医科大学宣武医院\n18. 首都儿科研究所附属儿童医院\n19. 首都医科大学附属北京中医医院\n20. 北京大学口腔医院\n21. 北京市顺义区医院\n22. 北京市大兴区人民医院\n23. 北京市房山区良乡医院\n24. 北京医院\n25. 北京中医药大学东方医院\n26. 民航总医院\n27. 首都医科大学附属北京世纪坛医院（北京铁路总医院）\n28. 北京市海淀医院\n29. 北京市平谷区医院\n30. 北京市昌平区医院\n31. 北京清华长庚医院\n32. 首都医科大学附属北京妇产医院\n33. 北京中医药大学第三附属医院\n34. 北京市垂杨柳医院\n35. 北京市延庆区医院（北京大学第三医院延庆医院）\n36. 北京市房山区中医医院（北京中医药大学房山医院）\n37. 北京中医药大学第三附属医院密云院区\n38. 北京市通州区妇幼保健院\n39. 中国医学科学院肿瘤医院\n40. 首都医科大学附属北京口腔医院\n41. 首都医科大学附属北京佑安医院\n42. 北京肿瘤医院\n43. 北京华信医院（清华大学第一附属医院）\n44. 北京市昌平区中医医院\n45. 首都医科大学附属北京安定医院\n46. 北京市第一中西医结合医院\n47. 北京市大兴区中西医结合医院\n48. 北京市隆福医院（北京中西医结合老年医院）\n49. 北京市大兴区妇幼保健院\n50. 北京老年医院\n51. 北京大学第六医院\n52. 北京市丰台区妇幼保健计划生育服务中心\n53. 首都医科大学附属北京地坛医院\n54. 北京北亚骨科医院\n55. 中国医学科学院整形外科医院\n56. 北京市朝阳区妇幼保健院\n57. 首都医科大学附属北京胸科医院\n58. 北京回龙观医院\n59. 北京市回民医院\n60. 北京小汤山医院\n61. 北京市顺义区妇幼保健院（北京儿童医院顺义妇儿医院）（北京市顺义区妇幼保健计划生育服务中心）\n62. 北京怀柔医院\n63. 京煤集团总医院\n64. 北京市西城区广外医院（北京市西城区广外老年医院）\n65. 北京市密云区医院\n66. 北京丰台右安门医院\n67. 首都医科大学附属复兴医院\n68. 航天中心医院\n69. 北京市昌平区中西医结合医院\n70. 航空总医院\n71. 中国医学科学院阜外医院\n72. 北京二龙路医院（肛肠医院）\n73. 北京市丰台中西医结合医院\n74. 石景山医院\n75. 北京中西医结合医院\n76. 北京市门头沟区妇幼保健院\n77. 北京市怀柔区中医医院\n78. 北京爱育华医院\n79. 国家电网公司北京电力医院\n80. 燕化医院\n81. 中国中医科学院望京医院\n82. 中国航天科工集团七三一医院\n83. 首都医科大学附属北京康复医院（北京工人疗养院）\n84. 北京市鼓楼中医医院\n85. 北京大学国际医院\n86. 北京博爱医院\n87. 北京市房山区妇幼保健院\n\n二级医院：\n1. 北京市第六医院\n2. 北京市普仁医院\n3. 北京市东城区第一人民医院\n4. 北京市朝阳区第三医院\n5. 北京市朝阳区双桥医院\n6. 北京市朝阳区中医医院\n7. 北京四季青医院\n8. 北京市中关村医院（中国科学院中关村医院）\n9. 北京市石景山区妇幼保健院（妇幼保健计划生育服务中心）\n10. 北京市门头沟区中医医院（北京市门头沟区老年病医院）\n11. 北京市房山区第一医院\n12. 北京市丰台区中医医院\n13. 北京航天总医院\n14. 北京市门头沟区医院\n15. 北京市丰台康复医院(北京市丰台区铁营医院)\n16. 北京市东城区妇幼保健计划生育服务中心\n\n\n### 能够查多长时间的检验检查报告？\n\n最长可查6个月内（自平台报告查询功能开通起）的检验检查报告。功能开通前的历史报告不支持查询。\n\n\n### 从其他渠道挂号就医后的检验检查报告，是否能在北京114预约挂号平台进行查询？\n\n在北京114预约挂号平台完成本人身份信息校验后，可以查询。\n\n\n### 公众使用北京114预约挂号平台过程中，如有问题、意见或建议应通过什么渠道反映解决？\n\n可拨打114，根据语音提示选择“2”接入人工坐席反映解决。或通过114预约挂号平台首页“建议反馈”专栏进行反馈。\n\n\n### 注册时填写手机号码有什么用？\n\n注册时填写的手机号码是预约环节、修改信息环节用于验证和接收信息的工具，且当医生临时停诊或发布重要通知时，我们能够及时通知到您。\n\n\n### 北京市预约挂号统一平台支持哪些证件类型注册？\n\n目前可使用居民身份证（包含现役军人、人民武装警察）、港澳居民居住证、台湾居民居住证、港澳居民来往内地通行证、台湾居民来往大陆通行证、外国人永久居留身份证及护照注册、预约挂号。\n\n\n### 无身份证号，或者已经申报户口但还未办理身份证的患儿如何注册预约？\n\n对于没有身份证号的患儿，建议前往医院儿童急、门诊挂号就诊或选择其他预约渠道。\n对于已经申报户口但还未办理身份证的患儿，可使用身份证号在统一平台上注册预约，并填写监护人的实名身份信息。就诊时凭带有身份证号码相关联的有效证件（如户口本）取号就诊，或者前往医院儿童急、门诊挂号就诊。\n\n\n### 填写患者的姓名和身份证件有什么用？\n\n患者身份证件信息是取号就诊的必要凭证。\n为规范号源管理，平台采用"实名制"预约挂号，用户在通过平台注册预约时，须提供"患者本人"的有效证件号、患者姓名和"预约手机号码"等信息。系统会通过用户填写的"预约手机号"将预约成功通知短信和预约识别码发送到用户手机上。\n患者到医院取号就诊时，须出示患者本人的有效证件及预约成功短信（部分医院适用），医务人员会核对患者预约信息，验证是否与在该院的就诊信息中的姓名、身份证号一致，若出现任何信息不符，可能会出现取号失败情况。\n\n\n### 患者注册信息填写有误，是否会影响就诊？\n\n患者在平台注册及预约都需实名制，就诊当天也需要凭患者真实有效证件取号，若信息不正确可能会影响当天取号就诊。建议用户发现注册信息有误时尽快修改，或者通过账号申诉流程联系平台工作人员进行修改。\n\n\n### 网站上显示有号，可填完资料提交时却告诉我没号了？\n\n平台存在很多用户同时预约此号的情况，该号源在您点击"预约确认"之前已被其他用户先预约成功导致，您可选择其他医生或者改期预约。\n\n\n### 为什么我无法预约？\n\n**原因一：** 请确认是否已正常注册/登录。\n**原因二：** 请确认您是否按照预约流程正常操作，也可致电114协助解决。\n**原因三：** 请确认您是否已经违反平台规定（恶意挂号和取消、多次无故爽约、倒号行为等），目前已进入黑名单或爽约用户，该类用户将被限制使用预约挂号服务。\n**原因四：**使用平台预约挂号服务需先实名注册，用户实名认证通过后，可正常在网上预约挂号，请确保您是否已经通过认证。\n**原因五：** 为了防止号贩子倒号行为，满足绝大多数百姓的最大利益和公平性，统一平台采取了预约挂号限制。平台做出如下限制：\n1.同一自然日，同一医院，同一科室，同一就诊单元，同一就诊人，可以预约最多1个号源（就诊单元分为上午、下午、晚上、全天）；\n2. 同一自然日，同一就诊单元，同一就诊人，不同医院，可以预约最多3个号源（就诊单元分为上午、下午、晚上、全天）；\n3. 同一自然日，同一就诊人，可以预约最多4个号源；\n4. 同一自然周（周一到周日），同一就诊人，可以预约最多14个号源；\n5. 同一自然月，同一就诊人，可以预约最多20个号源；\n6. 同一自然季度内，同一就诊人，可以预约最多30个号源。\n\n因患者个人原因主动退号，所退号源仍占用挂号名额；因医生停诊、系统问题等导致等退号，不占用可挂号的配额。\n**原因六：** 平台短信系统繁忙，造成短信验证码发送延迟，请稍后再试，或通过114电话预约挂号。\n\n\n### 号源需提前多少天预约？\n\n用户一般可预约次日起至三个月内的就诊号源，由于各医院规定不同，具体预约挂号周期，以平台公示为准，建议您尽量提前预约。\n\n\n### 平台什么时间放号，什么时间可以预约？\n\n平台上各家医院的放号时间有所不同，具体以各家医院预约须知为准。平台已放出的号是24小时开放预约的，用户可自行预约。\n\n\n### 为什么我老是收不到验证短信？\n\n可能为短信系统繁忙等原因，导致短信下发延迟。或者由于运营商或者用户手机问题引起的，例如：\n1. 用户长时间关机或者不在服务区等导致的短信超时没有发送到用户手机上；\n2. 处于停机状态等原因；\n3. 确认手机是否被手机系统设置自动拦截，被误认为"垃圾短信"；\n4. 注册手机号码错误或者号码无效；\n\n\n### 如何知道已预约成功？\n\n确认预约后，就诊人注册时填写的手机号会同步收到“预约成功短信”以示成功，同时您可以通过网站或微信公众号的"个人中心-挂号订单"选择对应就诊人查询订单状态。\n请您妥善保存短信，如您未收到短信或者丢失短信，请与114电话联系，人工核实信息后，系统会重新为您发送短信。\n\n### 爽约的判定以及处罚？\n\n爽约是指用户未按医院规定的取号时间提前到医院指定的挂号窗口取号，且超过预约就诊时间未能按时就诊即视为爽约，该预约号源自动作废。如仍需就诊可重新预约或到医院挂号窗口挂号。一年内（自然年）无故爽约累计达到3次的用户将自动进入系统爽约名单，此后3个月内将取消其预约挂号资格。\n\n\n### 爽约记录的查询和申诉？\n\n用户在网站、微信服务号中，可以点击"个人中心-挂号订单”选择对应就诊人查询订单信息，部分医院的挂号订单会展现爽约状态。如您有任何疑问或不解请关注“北京114预约挂号”微信公众号按流程填写申诉信息，工作人员会尽快受理。\n\n\n### 预约号能转让吗？\n\n不能，预约挂号实行实名制，预约号只供本人使用。\n\n\n### 预约挂号成功后，临时去不了，能否取消预约？\n\n用户在医院规定的取消时限内可以取消预约号，超过退号截止时间系统将限制用户退号。（注：每家医院的预约取消截止时间有所不同，具体规则请关注约成短信或各家医院的个性化预约须知）\n\n\n### 没有及时取消预约，也不按时取号就诊，会产生什么影响？\n\n由于号源比较紧张，如您不及时取消预约，也不按时取号就诊，则会视为爽约，系统会记爽约记录，今后将会影响到您使用预约挂号服务。\n\n\n### 什么是挂号、退号截止时间？\n\n医院需要将患者的预约记录提前收集录入医院系统里，便于就诊当日现场的有序就诊。用户须在截止时间前使用预约挂号服务或进行退号操作，超出预约截止时间，系统将限制操作。具体截止时间各医院不同，为保证您顺利的预约或取消预约号，请尽量提前操作，具体时间请参见各医院须知。若过了医院指定的取号、取消时间，建议您咨询114或咨询医院处理。\n\n\n### 挂号成功后但是医师临时停诊了怎么办？\n\n临时停诊是指医生可能因为临时的抢救、保障任务等特殊原因而临时无法出诊的情况，因此不可避免，请患者谅解和配合。遇到此类情况，我们会通过短信或者电话通知到您。\n\n\n### 注册、修改信息、预约等环节点击发送短信验证码的次数是否有限制？\n\n每个用户每天在预约挂号统一平台上注册、修改信息、预约等环节，点击发送短信验证码的次数是有总体限制的，请合理正常的使用操作，超过限制次数只能次日尝试操作或者拨打114电话预约挂号。\n\n\n### 预约挂号统一平台对于预约次数有限制么？\n\n为了防止号贩子倒号行为，满足绝大多数百姓的最大利益和公平性，统一平台采取了预约挂号限制。平台做出如下限制：\n1.同一自然日，同一医院，同一科室，同一就诊单元，同一就诊人，可以预约最多1个号源（就诊单元分为上午、下午、晚上、全天）；\n2. 同一自然日，同一就诊单元，同一就诊人，不同医院，可以预约最多3个号源（就诊单元分为上午、下午、晚上、全天）；\n3. 同一自然日，同一就诊人，可以预约最多4个号源；\n4. 同一自然周（周一到周日），同一就诊人，可以预约最多14个号源；\n5. 同一自然月，同一就诊人，可以预约最多20个号源；\n6. 同一自然季度内，同一就诊人，可以预约最多30个号源。\n7. 同一自然日，同一就诊人，最多取消2个号源；\n\n因患者个人原因主动退号，所退号源仍占用挂号名额；因医生停诊、系统问题等导致退号，不占用可挂号的配额。\n\n\n### 预约成功后，如何去医院取号就诊？\n\n成功预约挂号后，系统将自动保存用户预约记录。就诊当天，您需要在医院规定的取号时间之内，前往医院指定的地点取号，并缴纳医院规定的医事服务费，逾期预约自动作废。具体取号时间和取号地点请查阅系统下发的预约成功短信和各家医院的个性化预约须知，或者拨打114人工客服电话协助查询。\n取号时需要提供以下重要凭证：\n就诊当日取号时，就诊人需凭就诊人本人注册的有效证件原件、预约成功通知短信和预约识别码至医院指定的挂号窗口取号；取号时医务人员将核对就诊者的身份信息和预约记录，如信息验证不符，则医院不能提供相应的诊疗服务。\n\n\n### 预约成功后，去医院需要排队吗？\n\n预约成功后，您需要在规定时间内排队取号，具体就诊位数及时间以各医院安排为准。\n\n\n### 我能不能稍微迟会到医院取号？\n\n如超过医院规定的时间未取号，本次预约号源作废。建议用户合理安排自己的时间，按时取号就诊。\n'
};

const account = {
  code: 200,
  msg: null,
  data: '### 平台账号管理?\n\n### 用户信息发生变更如何修改?\n用户注册成功后，需对用户信息进行修改(如手机号码等)，在就诊人信息中进行修改，如原注册手机号有效，用户可选择在线自助修改手机号，修改其它账号信息可提交申诉流程，请关注“北京114预约挂号”微信公众号按流程填写申诉信息。\n用户资料修改注意几下几点：\n\n* 请保证您的统一平台账户信息真实有效，如用错误信息，或虚假信息预约挂号，不仅在就诊当日影响您取号就诊，同时也会影响到您今后的预约行为。\n* 用户如修改本人注册姓名、有效证件号、手机号，请关注“北京114预约挂号”微信公众号按流程填写申诉信息，我们会在5个工作日内处理完成，申诉结果会以短信形式发送给申诉信息中的手机号。\n* 如遇"无法登录"等特殊情况，请关注“北京114预约挂号”微信公众号按流程填写申诉信息，我们会在5个工作日内处理完成，申诉结果会以短信形式发送给申诉信息中的手机号。\n* 为保证注册用户的信息安全，在线申诉时须提供用户本人与证件合照，仅供北京市预约挂号统一平台申诉使用，敬请理解。\n\n### 名字、身份证件号码不小心输错了，手机号换号了或者停机了，怎么办？\n修改个人信息，请关注“北京114预约挂号”微信公众号按流程填写申诉信息，我们会在5个工作日内处理完成，申诉结果会以短信形式发送给申诉信息中的手机号。请您严格按照以上流程操作，确保您的申请得到及时处理，谢谢您的配合。\n\n### 账号为什么会被冻结？如何申诉\n如果您已经被判定为爽约用户或者判定为黑名单用户，可能会导致您的账号被冻结。如您有任何疑问或不解可关注“北京114预约挂号”微信公众号按流程填写申诉信息 ，选择申诉理由“其它”，描述您遇到的问题，工作人员会尽快受理。以上惩罚措施会严格执行，请各位用户管理好自己的预约帐户，以免产生不必要的麻烦！'
};

const generalRules = {
  code: 200,
  msg: null,
  data: '# 预约挂号须知总则\n\n为提高患者预约效率、改善患者预约体验，北京市卫生健康委以方便百姓就医的服务宗旨,建立北京市预约挂号统一平台（以下简称"平台"），为保证您预约挂号成功，请您认真阅读预约挂号服务须知：\n\n**平台预约挂号渠道：**\n\n**1.微信公众号**：微信搜索“北京114预约挂号”公众号；\n\n**2.“京通”小程序**：在微信、支付宝、百度APP搜索“京通”小程序，选择“北京通”菜单—点击“预约挂号114”模块；\n\n**3.预约电话**：114（北京用户）、010-114（非北京用户），提供7\\*24小时服务。\n\n\n### 一、预约范围\n\n1. 用户可预约平台各医院当日/次日起至三个月内的就诊号源（各医院放号周期不同，请以各家医院的个性化预约须知为准）。具体预约挂号周期和号源信息，以114服务电话查询和网站公示为准。\n2. 每天可预约次日号源的服务时间以各家医院的个性化预约须知为准。\n\n### 二、实名制注册预约\n\n1. 平台预约挂号采取实名制注册预约，用户首次预约须填写就诊人真实有效的基本信息，包括就诊人员的真实姓名、有效证件号（包括居民身份证、港澳居民居住证、台湾居民居住证、港澳居民来往内地通行证、台湾居民来往大陆通行证、外国人永久居留身份证、护照）、性别、手机号码等基本信息。\n2. 用户到医院取号就诊时须出示与预约登记实名信息一致的本人有效证件，否则医院不予办理挂号业务及诊疗服务。\n3. 注册账号最多可以同时绑定四位就诊人。\n4.注册账号每自然年内，最多可以绑定八位就诊人。\n5.同一手机号，最多同时可以被八位就诊人作为联系电话。\n6. 网站注册预约须要求用户准备好手机，"手机短信验证" 是网站/移动端注册预约流程的重要环节，若没有通过验证，用户无法成功注册预约，故请务必填写真实有效的手机号码。\n7. 用户也可通过114（非北京用户010-114）电话服务热线进行人工注册、预约，拨打114电话注册时需登记真实有效的手机号码。\n8.北京市预约挂号统一平台实名认证服务时间为每日7:40-21:50，其他时间用户进行实名认证服务可能会受到影响，为不影响您正常预约挂号，请您在每日7:40-21:50完成实名信息认证。给您带来的不便敬请谅解。\n\n### 三、账户信息管理\n\n1. 请保证您的平台账户信息真实有效，如用错误信息，或虚假信息预约挂号，不仅会在就诊当日影响您取号就诊，同时也会影响到您今后的预约行为。\n2. 就诊用户名下存在未就诊的预约号源时，无法申请解绑就诊人。\n3. 用户如需修改账号实名信息等，可关注"北京114预约挂号"微信公众号提交申诉，须提供用户本人与有效证件的人证合一照片，以便工作人员核实信息，我们将在5个工作日内协助处理完成，并以短信方式通知到您。\n4. 平台不支持修改证件号码的申请。（注：该申请需用户重新注册）\n5. 如遇"无法登录"等特殊情况，用户可在线申诉，或拨打010-114协助解决。\n\n\n### 四、预约确认与就诊\n\n1. 通过平台预约成功后，系统会自动下发预约成功短信及唯一的8位数字识别码到用户注册手机上。\n2. 预约成功后，请您妥善保存"预约成功短信和预约识别码"，以便随时查询和取消预约信息，同时该信息也是您用于取号就诊的重要凭证。\n3. 如果您未收到或丢失"预约成功短信和预约识别码"，可登录平台"个人中心-挂号订单"中找到相应的订单查看详情，或者拨打114客服电话协助查询，工作人员与您核实信息后，系统会重新为您发送约成短信和识别码。\n4. 成功预约挂号后，系统将自动保存用户预约记录。就诊当天，您需要在医院规定的取号时间之内，前往医院指定的地点取号就诊，并缴纳医院规定的医事服务费，逾期预约自动作废。具体取号时间和取号地点请查阅系统下发的预约成功通知短信，或各家医院的个性化预约须知。\n5. 取号时需要提供以下重要凭证：\n   * 就诊当日取号时，就诊人需凭就诊人本人注册的有效证件原件、预约成功通知短信和预约识别码至医院指定的挂号窗口取号（个别医院要求先办理就诊卡并关联社保卡后再取号，具体详见各家医院的个性化预约须知）；取号时医务人员将核对就诊者的身份信息和预约记录，如信息验证不符，则医院不能提供相应的诊疗服务。\n \n\n### 五、查询、取消预约\n\n1. 用户在医院规定的取消时限内可以取消预约号，超过退号截止时间系统将限制用户退号（注：个别医院的预约取消截止时间有所不同，具体规则请关注各家医院的个性化预约须知）。\n2. 在医院规定的取消预约时限内，用户可登录统一平台网站的"个人中心"直接取消，或拨打114客服电话进行查询/退号操作，退号时需凭"预约识别码"进行取消。\n3. 如果您在就诊当天不能前往医院取号就诊，请提前退号，否则会因造成号源的浪费，影响其他患者的就诊而被记录爽约档案，由此会影响到您今后的预约行为，请您谅解。\n\n### 六、预约限制\n\n为了防止号贩子倒号行为，满足绝大多数百姓的最大利益和公平性，平台采取了如下预约限制：\n1.  同一自然日，同一医院，同一科室，同一就诊单元，同一就诊人，可以预约最多1个号源（就诊单元分为上午、下午、晚上、全天）；\n2. 同一自然日，同一就诊单元，同一就诊人，不同医院，可以预约最多3个号源（就诊单元分为上午、下午、晚上、全天）；\n3. 同一自然日，同一就诊人，可以预约最多4个号源；\n4. 同一自然周（周一到周日），同一就诊人，可以预约最多14个号源；\n5. 同一自然月，同一就诊人，可以预约最多20个号源；\n6. 同一自然季度内，同一就诊人，可以预约最多30个号源。\n\n\n因患者个人原因主动退号，所退号源仍占用挂号名额；因医生停诊、系统问题等导致退号，不占用可挂号的配额。\n\n\n黑名单限制\n用户须为注册账户下的一切行为负责，平台检测到存在异常挂号行为的用户，将加入平台黑名单，停止并不再提供预约挂号服务。用户承担由此产生的一切法律责任。\n\n\n### 七、爽约的判定及处罚\n\n1. 爽约是指用户未按医院规定的取号时间提前到医院指定的挂号窗口取号，且超过预约就诊时间未能按时就诊即视为爽约，该预约号源自动作废。如仍需就诊可重新预约或到医院挂号窗口挂号。\n2. 一年内（自然年）无故爽约累计达到3次的爽约用户将自动进入系统爽约名单，此后3个月内将取消其预约挂号资格。\n### 八、特别声明\n\n1. 以上为平台服务总则，各家医院的特殊预约规则详见医院首页公示的"预约须知"。\n2. 平台不收取医事服务费，各家医院仅收取与医生职称相对应的医事服务费，如与您预约时不符，则以当日医院挂号窗口为准。\n3. 用户如需医保报销，请预约医保限定的定点报销医院。\n4. 请不要随意向他人泄露自己的实名身份信息。\n5. 本服务为用户提供便捷的预约方式，不承诺所有用户随时都能约到指定的号，有不便之处敬请谅解，有任何好的建议也可以直接向我们反馈。'
};

const register = {
  code: 200,
  msg: null,
  data: '### 平台如何注册？\n**第一步**\n进入北京114预约挂号平台，点击个人中心，系统跳转至“登录”页面。\n\n![](//img.114yygh.com/image/image-001/45450411730684288.png)\n\n**第二步**\n根据系统提示填写手机号验证码，并输入姓名和证件号码，完成实名认证，提交注册。\n\n![](//img.114yygh.com/image/image-001/45450451135689180.png)\n\n![](//img.114yygh.com/image/image-001/45453177512278168.png)\n\n**第三步**\n完成注册后可添加就诊人、添加就诊卡预约挂号。\n\n![](//img.114yygh.com/image/image-001/45450476993188882.png)\n\n**温馨提示**\n\n* 身份证号和姓名须是患者本人的，且与身份证信息保持一致。\n* 手机号建议用户正确填写自己的真实有效号码，以便正常的接收平台下发的短信。\n\n### 注册账号有几种方式？\n\n您可在微信、支付宝、百度APP搜索“京通”小程序（，选择“北京通”菜单—点击“预约挂号114”模块）、微信搜索【北京114预约挂号】微信公号、登录北京市预约挂号统一平台网站或拨打114电话注册用户信息。\n\n### 为什么需要提交实名信息？\n\n因为挂号预约时，医院需要将实名信息与医保卡关联并进行登记，为您的就诊带来方便。同时为抑制倒号行为，保障就诊患者权益，到医院取号时也需要核对患者实名信息。\n所以，请注册您的真实有效信息，否则我们可能将无法提供服务。\n\n### 一个手机号可以注册几个账号？\n\n一个手机号可以注册1个账号，注册账号每自然年内，最多可以绑定八位就诊人。\n\n### 收不到短信注册码怎么办？\n\n**方法一：** 确认短信是否被手机系统设置自动拦截，被误认为"垃圾短信"。\n**方法二：** 确认注册手机号是否正确。\n**方法三：** 若超过3分钟仍未收到短信注册码，可点击注册页面的"点击获取"，再次重发（以最后一次接收到的短信注册码为准）。\n**方法四：** 若再次查收仍未收到短信注册码，更换其他手机号尝试重新注册。\n**方法五：** 拨打114/010114人工客服协助解决。\n\n### 我的身份证件信息已被注册占用了怎么办？\n\n如果该账号是您自己注册的，您可以直接使用该账号登录，并核实确认账号信息是否是本人的真实信息；\n如果系统提示"该身份证件信息已被注册"，并且确认该账号不是您注册的，您可以关注【北京114预约挂号】微信公众号提交申诉，请提供您的真实姓名、联系手机、身份证号码等相关信息，平台将在5个工作日内处理完成，申诉结果会以短信形式发送至申诉信息预留的手机号上。\n\n### 平台移动端注册后，用户拨打114电话预约还需要再次注册吗？\n\n不需要，平台注册信息是互通的，可直接拨打114电话预约挂号。 \n\n### 注册失败报错及原因分析？\n有以下四种可能：\n**情况一：** 自己的家人或朋友已经帮忙注册了，自己不知情或忘记了，待进一步了解清楚后直接登录即可，无须再注册。\n**情况二：** 注册信息有误，请进一步核实注册信息。\n**情况三：** 短信验证码填写错误，短信验证码应由6位数字组成，重复发送以最后一次接收到的短信注册码为准。如有问题请致电114电话协助解决。\n\n### 平台注册规则？\n注：须以就诊者本人的真实有效信息实名注册。\n**姓名**\n\n* 中文名只能由汉字开头的汉字和" · "组成，长度大于等于2个汉字并且小于等于10个汉字。\n* 英文名只能由英文字母开头的英文字母、" . "和空格组成，长度大于等于4个字符并且小于等于20个字符。\n\n**证件号码**\n\n* 身份证：18位有效身份证。其中省份、生日、性别必须符合身份证规则。\n* 军官证：大于等于8并且小于等于10个字符。\n* 护照：大于等于7并且小于等于15个字符。\n* 港澳通：大于等于9并且小于等于12个字符。\n* 台胞证：大于等于8并且小于等于11个字符。\n\n**手机号码**\n\n* 11位并且以1开头的数字。'
};

const login = {
  code: 200,
  msg: null,
  data: "### 如何登录平台\n**第一步**\n进入北京114预约挂号平台，选择个人中心，系统跳转至“登录”页面。\n\n**第二步**\n根据系统提示填写手机号、验证码完成登录，若在平台绑定过微信，可点击微信登陆进行登录。\n\n![](//img.114yygh.com/image/image-001/45450411730684288.png)\n\n**温馨提示**\n关于114电话注册用户首次登录平台移动端信息认证问题？\n* 用户在114电话注册就诊人信息后，用户使用微信、支付宝、百度APP搜索“京通”小程序访问北京114预约挂号平台或在微信上搜索关注“北京114预约挂号”公众号时，需先注册账号，账号完成实名认证后即可添加在114电话注册的就诊人信息。"
};

export const getSupportNavList = () => {
  return Promise.resolve(support);
};

// export const getSupportNavList = () => {
//   return request.get("/");
// };

export const getCommon = () => {
  return Promise.resolve(common);
};

export const getAccount = () => {
  return Promise.resolve(account);
};

export const getGeneralRules = () => {
  return Promise.resolve(generalRules);
};

export const getRegister = () => {
  return Promise.resolve(register);
};

export const getLogin = () => {
  return Promise.resolve(login);
};
